--- a/modeling.md
+++ b/modeling.md
@@ -7,11 +7,11 @@
 A **solid line** is drawn from the child class (the class inheriting the behavior) with a closed,  
 **unfilled arrowhead** (or triangle) pointing to the super class.
 
-```mermaid
-classDiagram 
-    direction BT
-    CheckingAccount --|> BankAccount
-    SavingsAccount --|> BankAccount
+```plantuml
+@startuml
+BankAccount <|-- CheckingAccount 
+BankAccount <|-- SavingsAccount
+@enduml
 ```
 
 ## Associations
